app/controllers/users_controller.rb

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "tweeticon.png",
      password: params[:password]
    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "image_name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
   @user = User.find_by(id: params[:id])
   @user.destroy
     redirect_to("/users/index")
     flash[:notice]="ユーザー情報を削除しました"
   end

    if @user.save
---
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "1.jpg"], ["updated_at", "2020-05-05 11:23:56.727654"], ["id", 1]]